//app.js
App({
  onLaunch: function () {
    
    if (!wx.cloud) {
      console.error('请使用 2.2.3 或以上的基础库以使用云能力')
    } else {
      wx.cloud.init({
        // env 参数说明：
        //   env 参数决定接下来小程序发起的云开发调用（wx.cloud.xxx）会默认请求到哪个云环境的资源
        //   此处请填入环境 ID, 环境 ID 可打开云控制台查看
        //   如不填则使用默认环境（第一个创建的环境）
        env: '********',
        traceUser: true,
      })
    }

   
  },
  globalData:{
    userInfo: "hello",
    question:[{"question":"强壮而敏捷的身体对我很重要","option":{"A":"对","B":"错"}},{"question":"我必须彻底地了解事情的真相","option":{"A":"对","B":"错"}}
    ,{"question":"我的心情受音乐、色彩和美丽事物的影响很大","option":{"A":"对","B":"错"}},{"question":"和他人的关系丰富了我的生命并使它有意义","option":{"A":"对","B":"错"}}
    ,{"question":"我相信我会成功","option":{"A":"对","B":"错"}},{"question":"我做事必须有清楚的指引","option":{"A":"对","B":"错"}}
    ,{"question":"我擅长自己创作、修理东西","option":{"A":"对","B":"错"}},{"question":"我可以花很长时间去想通事情的道理","option":{"A":"对","B":"错"}}
    ,{"question":"我重视美丽的环境","option":{"A":"对","B":"错"}},{"question":"我愿意花时间帮别人解决个人危机","option":{"A":"对","B":"错"}}
    ,{"question":"我喜欢竞争","option":{"A":"对","B":"错"}},{"question":"我在开始一个计划前会花很多时间去计划","option":{"A":"对","B":"错"}}
    ,{"question":"我喜欢用双手做事","option":{"A":"对","B":"错"}},{"question":"探索新构思使我满意","option":{"A":"对","B":"错"}}
    ,{"question":"我寻求新方法来发挥我的创造力","option":{"A":"对","B":"错"}},{"question":"我认为能把自己的焦虑和别人分担是很重要的","option":{"A":"对","B":"错"}}
    ,{"question":"成为群体中的关键任务执行者，对我来说很重要","option":{"A":"对","B":"错"}},{"question":"我对于自己能重视工作中的所有细节感到骄傲","option":{"A":"对","B":"错"}}
    ,{"question":"我不在意工作时把手弄脏","option":{"A":"对","B":"错"}},{"question":"我认为教育是个发展及磨练脑力的终身学习过程","option":{"A":"对","B":"错"}}
    ,{"question":"我喜欢非正式的穿着，尝试新颜色和款式","option":{"A":"对","B":"错"}},{"question":"我常能体会到某人想要和他人沟通的需要","option":{"A":"对","B":"错"}}
    ,{"question":"我喜欢帮助别人不断改进","option":{"A":"对","B":"错"}},{"question":"我在决策时，通常不愿冒险","option":{"A":"对","B":"错"}}
    ,{"question":"我喜欢购买小零件，做成成品","option":{"A":"对","B":"错"}},{"question":"有时我长时间阅读，玩拼图游戏，冥想生命的本质","option":{"A":"对","B":"错"}}
    ,{"question":"我有很强的想象力","option":{"A":"对","B":"错"}},{"question":"我喜欢帮助别人发挥天赋和才能","option":{"A":"对","B":"错"}}
    ,{"question":"我喜欢监督事情直至完工","option":{"A":"对","B":"错"}},{"question":"如果我面对一个新场景，会在事前做充分的准备","option":{"A":"对","B":"错"}}
    ,{"question":"我喜欢独立完成一项任务","option":{"A":"对","B":"错"}},{"question":"我渴望阅读或思考任何可以引发我好奇心的东西","option":{"A":"对","B":"错"}}
    ,{"question":"我喜欢尝试创新的概念","option":{"A":"对","B":"错"}},{"question":"如果我和别人摩擦，我会不断尝试化干戈为玉帛","option":{"A":"对","B":"错"}}
    ,{"question":"要成功就必须定高目标","option":{"A":"对","B":"错"}},{"question":"我喜欢为重大决策负责","option":{"A":"对","B":"错"}}
    ,{"question":"我喜欢直言不讳，不喜欢转弯抹角","option":{"A":"对","B":"错"}},{"question":"我在解决问题前必须把问题分析彻底","option":{"A":"对","B":"错"}}
    ,{"question":"我喜欢重新布置我的环境，使它们与众不同","option":{"A":"对","B":"错"}},{"question":"我经常借着和别人交谈来解决自己的问题","option":{"A":"对","B":"错"}}
    ,{"question":"我常常想要起草一个计划，而由别人的完成细节","option":{"A":"对","B":"错"}},{"question":"准时对我来说非常重要","option":{"A":"对","B":"错"}}
    ,{"question":"从事户外活动使我神清气爽","option":{"A":"对","B":"错"}},{"question":"我不断的问自己：为什么","option":{"A":"对","B":"错"}}
    ,{"question":"我喜欢自己的工作能够抒发我的情绪和感觉","option":{"A":"对","B":"错"}},{"question":"我喜欢帮助别人找可以和他人相互关注的方法","option":{"A":"对","B":"错"}}
    ,{"question":"弄够参与重大决策是令人兴奋的事情","option":{"A":"对","B":"错"}},{"question":"我经常保持清洁，喜欢有条不紊","option":{"A":"对","B":"错"}}
    ,{"question":"我喜欢周边环境简单而实际","option":{"A":"对","B":"错"}},{"question":"我会不断地思索一个问题，直到找出答案为止","option":{"A":"对","B":"错"}}
    ,{"question":"大自然的美深深地触动我的灵魂","option":{"A":"对","B":"错"}},{"question":"亲密的人际关系对我很重要","option":{"A":"对","B":"错"}}
    ,{"question":"升迁和进步对我极其重要","option":{"A":"对","B":"错"}},{"question":"当我把每日学习计划好时，我会比较有安全感","option":{"A":"对","B":"错"}}
    ,{"question":"我不害怕过重的学习负荷，且知道学习的重点","option":{"A":"对","B":"错"}},{"question":"我喜欢能使我思考，给我新观念的书","option":{"A":"对","B":"错"}}
    ,{"question":"我希望能够看到艺术表演、戏剧和好的电影","option":{"A":"对","B":"错"}},{"question":"我对别人的情绪低潮相当地敏感","option":{"A":"对","B":"错"}}
    ,{"question":"能影响别人使我感到兴奋","option":{"A":"对","B":"错"}},{"question":"当我答应一件事时，我会尽力监督所有的细节","option":{"A":"对","B":"错"}}
    ,{"question":"当我答应一件事时，我会尽力监督所有细节","option":{"A":"对","B":"错"}}]
  }
})
